In [1]:
import numpy as np
import pandas as pd

In [3]:
a = pd.Series(np.random.random(10))
a

0    0.911592
1    0.966065
2    0.449462
3    0.628483
4    0.794090
5    0.728377
6    0.875814
7    0.276788
8    0.354605
9    0.229609
dtype: float64

In [4]:
a[0]

0.9115922634293613

In [5]:
a[5]

0.7283766338235589

In [6]:
colnames = ['Column1', 'Column2', 'Column3', 'Column4', 'Column5']
df = pd.DataFrame(np.random.random((10,5)), columns = colnames)
df

    Column1   Column2   Column3   Column4   Column5
0  0.473458  0.746628  0.785700  0.401905  0.156213
1  0.559982  0.453140  0.560072  0.268335  0.153648
2  0.129839  0.093678  0.408520  0.189425  0.605211
3  0.283927  0.365538  0.262019  0.397621  0.434578
4  0.087295  0.692032  0.340793  0.938777  0.108189
5  0.636456  0.080739  0.208346  0.937655  0.369336
6  0.390405  0.716772  0.529219  0.067252  0.413832
7  0.913476  0.117316  0.958771  0.743668  0.663915
8  0.912429  0.607741  0.295288  0.568842  0.286670
9  0.389098  0.896240  0.989486  0.232274  0.665239

In [7]:
df['Column1']

0    0.473458
1    0.559982
2    0.129839
3    0.283927
4    0.087295
5    0.636456
6    0.390405
7    0.913476
8    0.912429
9    0.389098
Name: Column1, dtype: float64

In [11]:
df[['Column1', 'Column3', 'Column5']]

    Column1   Column3   Column5
0  0.473458  0.785700  0.156213
1  0.559982  0.560072  0.153648
2  0.129839  0.408520  0.605211
3  0.283927  0.262019  0.434578
4  0.087295  0.340793  0.108189
5  0.636456  0.208346  0.369336
6  0.390405  0.529219  0.413832
7  0.913476  0.958771  0.663915
8  0.912429  0.295288  0.286670
9  0.389098  0.989486  0.665239

In [13]:
lst = [208500, 181500, 223500, 140000, 250000, 143000, 307000, 200000, 129900, 118000]

price_df = pd.DataFrame(lst, columns = ['SalePrice'])
price_df

   SalePrice
0     208500
1     181500
2     223500
3     140000
4     250000
5     143000
6     307000
7     200000
8     129900
9     118000

In [17]:
lst_lst = [[8450, 'CollgCr', 2003, 7, 208500],
           [9600, 'Veenker', 1976, 6, 181500],
           [11250, 'CollgCr', 2001, 7, 223500],
           [9550, 'Crawfor', 1915, 7, 140000],
           [14260, 'NoRidge', 2000, 8, 250000],
           [14115, 'Mitchel', 1993, 5, 143000],
           [10084, 'Somerst', 2004, 8, 307000],
           [10382, 'NWAmes', 1973, 7, 200000],
           [6120, 'OldTown', 1931, 7, 129900],
           [7420, 'BrkSide', 1939, 5, 118000]]


colnames =  ['LotSize', 'Neighborhood', 'YearBuilt', 'Quality', 'SalePrice']
pd.DataFrame(lst_lst, columns = colnames).head(2)

   LotSize Neighborhood  YearBuilt  Quality  SalePrice
0     8450      CollgCr       2003        7     208500
1     9600      Veenker       1976        6     181500

In [18]:
house_dict = {'Baker House': [7420, 'BrkSide', 1939, 5, 118000],
              'Beazley House': [14115, 'Mitchel', 1993, 5, 143000],
              'Dominguez House': [14260, 'NoRidge', 2000, 8, 250000],
              'Hamilton House': [6120, 'OldTown', 1931, 7, 129900],
              'James House': [11250, 'CollgCr', 2001, 7, 223500],
              'Martinez House': [9600, 'Veenker', 1976, 6, 181500],
              'Roberts House': [9550, 'Crawfor', 1915, 7, 140000],
              'Smith House': [8450, 'CollgCr', 2003, 7, 208500],
              'Snyder House': [10084, 'Somerst', 2004, 8, 307000],
              'Zuckerman House': [10382, 'NWAmes', 1973, 7, 200000]}

In [19]:
pd.DataFrame(house_dict)

,Baker House,Beazley House,Dominguez House,Hamilton House,James House,Martinez House,Roberts House,Smith House,Snyder House,Zuckerman House
0,7420,14115,14260,6120,11250,9600,9550,8450,10084,10382
1,BrkSide,Mitchel,NoRidge,OldTown,CollgCr,Veenker,Crawfor,CollgCr,Somerst,NWAmes
2,1939,1993,2000,1931,2001,1976,1915,2003,2004,1973
3,5,5,8,7,7,6,7,7,8,7
4,118000,143000,250000,129900,223500,181500,140000,208500,307000,200000

In [32]:
house_dict

{'Baker House': [7420, 'BrkSide', 1939, 5, 118000],
 'Beazley House': [14115, 'Mitchel', 1993, 5, 143000],
 'Dominguez House': [14260, 'NoRidge', 2000, 8, 250000],
 'Hamilton House': [6120, 'OldTown', 1931, 7, 129900],
 'James House': [11250, 'CollgCr', 2001, 7, 223500],
 'Martinez House': [9600, 'Veenker', 1976, 6, 181500],
 'Roberts House': [9550, 'Crawfor', 1915, 7, 140000],
 'Smith House': [8450, 'CollgCr', 2003, 7, 208500],
 'Snyder House': [10084, 'Somerst', 2004, 8, 307000],
 'Zuckerman House': [10382, 'NWAmes', 1973, 7, 200000]}

In [37]:
house_df = pd.DataFrame(house_dict).transpose()
house_df.columns = colnames
house_df.head(3)

                LotSize Neighborhood YearBuilt Quality SalePrice
Baker House        7420      BrkSide      1939       5    118000
Beazley House     14115      Mitchel      1993       5    143000
Dominguez House   14260      NoRidge      2000       8    250000

In [42]:
df = pd.DataFrame.from_dict(house_dict, orient = 'index', columns = colnames)
df.head(3)

                 LotSize Neighborhood  YearBuilt  Quality  SalePrice
Baker House         7420      BrkSide       1939        5     118000
Beazley House      14115      Mitchel       1993        5     143000
Dominguez House    14260      NoRidge       2000        8     250000

In [44]:
df['SalePrice'].sum()

1901400

In [45]:
df['LotSize'].mean()

10123.1

In [46]:
df['YearBuilt'].max()

2004

In [47]:
df['YearBuilt'].min()

1915